q_d = {"nth": "Выполняется ли необходимое условие сходимости?",   "geom": "Сходится ли данный ряд как геометрический?",
       "harm": "Сходится ли данный ряд как обобщенный гармонический?",
        "dalamber":"Какой признак на данном этапе самый подходящий?",
          "cauchy":"Какой признак на данном этапе самый подходящий?","raabe":"Какой признак на данном этапе самый подходящий?",
          "bertran":"Какой признак на данном этапе самый подходящий?", "gauss":"Какой признак на данном этапе самый подходящий?",
          "integral":"Какой признак на данном этапе самый подходящий?"}